# 一般テキストでの出現が稀な品詞が漢文、未知語、言いよどみ、ローマ字文、英単語の品詞を削除、変換
#
# - 漢文を含む文全体を削除 x 2
# - 未知語とその周辺を削除 x 4
# - 言いよどみとその周辺を削除 x 12 + 文頭単語削除による文頭の付け替え x 3
# - ローマ字文を含む文全体を削除 x 7
# - 英単語を一般名詞で置換 (暫定)
# を行う
#
# (web誤脱も除去してもよいが、87件ある)

cat ${1} | \
    sed -e '537963,537977 s/.*/DEL/g' | \
    sed -e '616011,616031 s/.*/DEL/g' | \
    sed -e '348712,348714 s/.*/DEL/g' | \
    sed -e '348847,348849 s/.*/DEL/g' | \
    sed -e '371136,371138 s/.*/DEL/g' | \
    sed -e '394908 s/.*/DEL/g'        | \
    sed -e '38312,38313 s/.*/DEL/g'   | \
    sed -e '334135 s/.*/DEL/g'        | \
    sed -e '355662 s/.*/DEL/g'        | \
    sed -e '362526,362527 s/.*/DEL/g' | \
    sed -e '405739,405740 s/.*/DEL/g' | \
    sed -e '406724,406727 s/.*/DEL/g' | \
    sed -e '489224,489225 s/.*/DEL/g' | \
    sed -e '651952,651953 s/.*/DEL/g' | \
    sed -e '707114,707115 s/.*/DEL/g' | \
    sed -e '752301,752302 s/.*/DEL/g' | \
    sed -e '780553,780554 s/.*/DEL/g' | \
    sed -e '963423,963424 s/.*/DEL/g' | \
    sed -e '405741 s/I/B/g'           | \
    sed -e '406724 s/I/B/g'           | \
    sed -e '752301 s/I/B/g'           | \
    sed -e '21708,21784 s/.*/DEL/g'   | \
    sed -e 's/英単語/名詞-普通名詞-一般/g' | \
    grep -v DEL
